app/mailers/order_mailer.rb

   def new_order_email(order)
       @order = order

#   def new_order_email
#     @user = params[:user]
#     @order = params[:order]

    attachments['receipt1.png'] = File.read('app/assets/images/receipt1.png')

    #   mail to: User.first.email, cc: User.all.pluck(:email), subject: "Order Approval!"
    mail(to: "loreydjefwa@gmail.com",
         cc: User.all.pluck(:email),
         bcc: "secret@quickfleet.com",
         subject: "Order Approval!")
---
SELECT "users"."email" FROM "users"