app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
---
  def index
    order = Order.all

INSERT INTO "orders" ("pickup", "destination", "use_profile_id", "created_at", "updated_at", "senderName", "receiverName", "amountPaid", "natureOfGoods") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "orders".* FROM "orders"
---
  def create
    order = Order.create!(order_params)
    render json: order, status: :created

    if @order.save
      OrderMailer.with(order: @order).new_order_email.deliver_later

DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 3]]
---
  def destroy
    order = find_order
    order.destroy

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def find_order
    Order.find(params[:id])