app/controllers/orders_controller.rb

  def destroy
    order = find_order
    order.destroy
---
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 14]]

  def find_order
    Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]