app/controllers/receipts_controller.rb

SELECT "receipts".* FROM "receipts"
---
  def index
    receipts = Receipt.all

SELECT "receipts".* FROM "receipts" WHERE "receipts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    receipt = Receipt.find(params[:receipt_no])

INSERT INTO "receipts" ("receipt_no", "sender_name", "receiver_name", "amount_paid", "nature_of_goods", "pickup", "destination", "order_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    receipt = Receipt.create!(receipt_params)