app/controllers/use_profiles_controller.rb

SELECT "use_profiles".* FROM "use_profiles"
---
        def index
            user_profiles = UseProfile.all